it/src/Documents/КомплектацияОбъектовОС/КомплектацияОбъектовОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплектацияОбъектовОС</name>
  <registerRecords>AccumulationRegister.РазмещениеОбъектов</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДомена</name>
    <type>
      <types>CatalogRef.ИдентификаторыДоменов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.ОбъектыКомпьютера</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/InformationRegisters/МестонахождениеОС/МестонахождениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестонахождениеОС</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещение</types>
    </type>
  </resources>
  <resources>
    <name>ОСВладелец</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ИмяДомена</name>
    <type>
      <types>CatalogRef.ИдентификаторыДоменов</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/Documents/КомплектацияОбъектовОС/ManagerModule.bsl
// Получить таблицу .
//
Функция ПолучитьТаблицуОбъектыВСоставеОС(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КомплектацияОбъектовОСКомплектующие.Ссылка КАК Регистратор,
	               |	КомплектацияОбъектовОСКомплектующие.Ссылка.Дата КАК Период,
	               |	ВЫБОР
	               |		КОГДА КомплектацияОбъектовОСКомплектующие.Количество > 0
	               |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	КОНЕЦ КАК ВидДвижения,
	               |	КомплектацияОбъектовОСОсновныеСредства.ОсновноеСредство КАК ИдентификаторКомпьютера,
	               |	КомплектацияОбъектовОСКомплектующие.Объект КАК ОбъектКомпьютера,
	               |	ВЫБОР
	               |		КОГДА КомплектацияОбъектовОСКомплектующие.Количество > 0
	               |			ТОГДА КомплектацияОбъектовОСКомплектующие.Количество
	               |		ИНАЧЕ КомплектацияОбъектовОСКомплектующие.Количество * -1
	               |	КОНЕЦ КАК Количество,
	               |	КомплектацияОбъектовОСКомплектующие.Объект.ШаблонСоответствия.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |	КомплектацияОбъектовОСКомплектующие.Объект.ШаблонСоответствия.ИдентификаторПрограммы.ПризнакУчета КАК ПризнакУчета,
	               |	МестонахождениеОССрезПоследних.Организация,
	               |	МестонахождениеОССрезПоследних.ПодразделениеОрганизации,
	               |	КомплектацияОбъектовОСКомплектующие.Ссылка.ИдентификаторДомена
	               |ИЗ
	               |	Документ.КомплектацияОбъектовОС.Комплектующие КАК КомплектацияОбъектовОСКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КомплектацияОбъектовОС.ОсновныеСредства КАК КомплектацияОбъектовОСОсновныеСредства
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(
	               |					&МоментВремени,
	               |					ОсновноеСредство В
	               |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |							КомплектацияОбъектовОСОсновныеСредства.ОсновноеСредство
	               |						ИЗ
	               |							Документ.КомплектацияОбъектовОС.ОсновныеСредства КАК КомплектацияОбъектовОСОсновныеСредства
	               |						ГДЕ
	               |							КомплектацияОбъектовОСОсновныеСредства.Ссылка = &Ссылка)) КАК МестонахождениеОССрезПоследних
	               |			ПО КомплектацияОбъектовОСОсновныеСредства.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство
	               |		ПО КомплектацияОбъектовОСКомплектующие.КлючСвязи = КомплектацияОбъектовОСОсновныеСредства.КлючСвязи
	               |			И КомплектацияОбъектовОСКомплектующие.Ссылка = КомплектацияОбъектовОСОсновныеСредства.Ссылка
	               |ГДЕ
	               |	КомплектацияОбъектовОСКомплектующие.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", ДополнительныеСвойства.ДляПроведения.Дата);
	Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()
